In [2]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Alice", "David"],
    "Age": [25, 30, 25, 30],
    "City": ["NY", "LA", "NY", "Chicago"]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

df_cleaned = df.drop_duplicates()

print("\nModified DataFrame (no duplicates)")
print(df_cleaned)

df[['Age', 'City']]

Original DataFrame:
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   30  Chicago

Modified DataFrame (no duplicates)
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   30  Chicago

   Age     City
0   25       NY
1   30       LA
2   25       NY
3   30  Chicago

In [3]:
df

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   30  Chicago

In [4]:
df.loc[df.Age==30] # based on age rows will be selected  loc
df.loc[(df.Name=='Alice') & (df.Age<35)] # based on name and age rows will be selected

    Name  Age City
0  Alice   25   NY
2  Alice   25   NY

In [5]:
#iloc -index-value based selection
# df.iloc[1]  # second row
df.iloc[0:2]  # first two rows

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA

In [6]:
df.loc[0:2]

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA
2  Alice   25   NY

In [7]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
        'Age': [25, 30, 22, 35, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df = pd.DataFrame(data)
# Display the entire DataFrame
print(df)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [8]:
# Access the 'Age' column
age_column = df['Age']
print(age_column)

0    25
1    30
2    22
3    35
4    28
Name: Age, dtype: int64

In [9]:
df

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [10]:
df=df.iloc[0:2]
print(df)

    Name  Age  Gender  Salary
0   John   25    Male   50000
1  Alice   30  Female   55000

In [20]:
df['Age']>18

0    True
1    True
Name: Age, dtype: bool

In [13]:
df[df['Age']>=28]
df_age_filter=df[df['Age']>=28]

In [14]:
df_age_filter

    Name  Age  Gender  Salary TEAM
1  Alice   30  Female   55000  Age

In [15]:
# Access the row at index 1 (second row)
second_row = df.iloc[1]
print(second_row)

Name       Alice
Age           30
Gender    Female
Salary     55000
TEAM         Age
Name: 1, dtype: object

In [16]:
# Access the first three rows and the 'Name' and 'Age' columns
subset = df.loc[0:2, ['Name', 'Age']]
print(subset)

    Name  Age
0   John   25
1  Alice   30

In [17]:
# Access rows where 'Age' is greater than 25
filtered_data = df[df['Age'] > 25]
print(filtered_data)

    Name  Age  Gender  Salary TEAM
1  Alice   30  Female   55000  Age

In [ ]:
dates = pd.date_range(start='2025-01-01', periods=25)
print(dates)

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10', '2025-01-11', '2025-01-12',
               '2025-01-13', '2025-01-14', '2025-01-15', '2025-01-16',
               '2025-01-17', '2025-01-18', '2025-01-19', '2025-01-20',
               '2025-01-21', '2025-01-22', '2025-01-23', '2025-01-24',
               '2025-01-25'],
              dtype='datetime64[ns]', freq='D')

In [24]:
import pandas as pd
data={'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
      'Age': [25, 30, 22, 35, 28],
      'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney']}
df=pd.DataFrame(data)
print(df)

      Name  Age      City
0     John   25  New York
1    Alice   30    London
2      Bob   22     Paris
3      Eve   35     Tokyo
4  Charlie   28    Sydney